#### Terraform Initialization ⚙️`success`
  </details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
[0m[1mmodule.ecs.data.template_file.template_app: Reading...[0m[0m
[0m[1mmodule.ecs.data.template_file.template_db: Reading...[0m[0m
[0m[1mmodule.ecs.data.template_file.template_db: Read complete after 0s [id=60ba6fa5438970afd2b463aa39759488dbea79ba1fdc3d975886844d36e8c66b][0m
[0m[1mmodule.ecs.data.template_file.template_app: Read complete after 0s [id=6514d979dd57de3e7e4a98492d045cf92b09d0b0f9042dbea79bf6f63e7264d5][0m
[0m[1mdata.aws_availability_zones.azs: Reading...[0m[0m
[0m[1mmodule.iam.data.aws_iam_policy_document.assume_role_policy: Reading...[0m[0m
[0m[1mmodule.ecs.aws_ecs_cluster.main_cluster: Refreshing state... [id=arn:aws:ecs:eu-west-1:891377364444:cluster/TL-ECS-cluster][0m
[0m[1mmodule.vpc.aws_vpc.custom_vpc: Refreshing state... [id=vpc-051fd7869f3611746][0m
[0m[1mmodule.subnet.aws_eip.eip_nat_gtw_az2: Refreshing state... [id=eipalloc-0e544d70381f8f149][0m
[0m[1mmodule.logs.aws_cloudwatch_log_group.log_group: Refreshing state... [id=/ecs/app][0m
[0m[1mmodule.subnet.aws_eip.eip_nat_gtw_az1: Refreshing state... [id=eipalloc-0d57ffde40e86bd74][0m
[0m[1mmodule.iam.data.aws_iam_policy_document.assume_role_policy: Read complete after 0s [id=1077804475][0m
[0m[1mmodule.iam.aws_iam_role.ecs_task_execution_role: Refreshing state... [id=limited-TL-ECS-Task-execution-role][0m
[0m[1mmodule.iam.aws_iam_role_policy.ecs_task_execution_role_inline_policy: Refreshing state... [id=limited-TL-ECS-Task-execution-role:get_secret_policy_for_docker_credentials][0m
[0m[1mmodule.iam.aws_iam_role_policy_attachment.ecs_task_execution_role_policy: Refreshing state... [id=limited-TL-ECS-Task-execution-role-20240529123005371700000001][0m
[0m[1mmodule.ecs.aws_ecs_task_definition.app: Refreshing state... [id=TL-ECS-task-definition][0m
[0m[1mmodule.ecs.aws_ecs_task_definition.db: Refreshing state... [id=TL-ECS-db-task-definition][0m
[0m[1mdata.aws_availability_zones.azs: Read complete after 0s [id=eu-west-1][0m
[0m[1mmodule.logs.aws_cloudwatch_log_stream.log_stream: Refreshing state... [id=todolist_log_stream][0m
[0m[1mmodule.vpc.aws_internet_gateway.igw: Refreshing state... [id=igw-0831e238ed4e5db21][0m
[0m[1mmodule.route_table.aws_route_table.private_route_table_az1: Refreshing state... [id=rtb-07cde90609f44c0c5][0m
[0m[1mmodule.subnet.aws_subnet.public_subnet_az1: Refreshing state... [id=subnet-07ea6776833b54666][0m
[0m[1mmodule.route_table.aws_route_table.private_route_table_az2: Refreshing state... [id=rtb-03fb13e8f02e37b34][0m
[0m[1mmodule.subnet.aws_subnet.private_subnet_az2: Refreshing state... [id=subnet-009d7bb995a18445c][0m
[0m[1mmodule.ecs.aws_service_discovery_private_dns_namespace.db: Refreshing state... [id=ns-apnoqvysavmltd3k][0m
[0m[1mmodule.alb.aws_alb_target_group.target_app: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-west-1:891377364444:targetgroup/TL-ALB-target-group/0a8f78064535c882][0m
[0m[1mmodule.route_table.aws_route_table.public_route_table: Refreshing state... [id=rtb-0d08237868ad3fa61][0m
[0m[1mmodule.subnet.aws_subnet.public_subnet_az2: Refreshing state... [id=subnet-04c3848ff86afb364][0m
[0m[1mmodule.security_groups.aws_security_group.alb_sg: Refreshing state... [id=sg-033398b444e466664][0m
[0m[1mmodule.subnet.aws_subnet.private_subnet_az1: Refreshing state... [id=subnet-0af2c1a07fb49b031][0m
[0m[1mmodule.route_table.aws_route.public_route: Refreshing state... [id=r-rtb-0d08237868ad3fa611080289494][0m
[0m[1mmodule.subnet.aws_nat_gateway.nat_gtw_az1: Refreshing state... [id=nat-0feb2b5e12515bedf][0m
[0m[1mmodule.security_groups.aws_security_group.ecs_sg: Refreshing state... [id=sg-099bf3505be50cd40][0m
[0m[1mmodule.route_table.aws_route_table_association.public_rt_association_az2: Refreshing state... [id=rtbassoc-05a9075f8a09880b7][0m
[0m[1mmodule.subnet.aws_nat_gateway.nat_gtw_az2: Refreshing state... [id=nat-0b30b1bd0ac4930a1][0m
[0m[1mmodule.route_table.aws_route_table_association.public_rt_association_az1: Refreshing state... [id=rtbassoc-0ac84b039d1ea5c54][0m
[0m[1mmodule.route_table.aws_route_table_association.private_rt_association_az1: Refreshing state... [id=rtbassoc-0de43db18f21bfd3d][0m
[0m[1mmodule.alb.aws_alb.main_alb: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-west-1:891377364444:loadbalancer/app/TL-ALB-alb/dcc3acf200d03e8e][0m
[0m[1mmodule.route_table.aws_route_table_association.private_rt_association_az2: Refreshing state... [id=rtbassoc-048014b75441e49ad][0m
[0m[1mmodule.ecs.aws_service_discovery_service.mysql: Refreshing state... [id=srv-ne7orl243ezxyz4d][0m
[0m[1mmodule.route_table.aws_route.private_route_az2: Refreshing state... [id=r-rtb-03fb13e8f02e37b341080289494][0m
[0m[1mmodule.route_table.aws_route.private_route_az1: Refreshing state... [id=r-rtb-07cde90609f44c0c51080289494][0m
[0m[1mmodule.ecs.aws_ecs_service.db_service: Refreshing state... [id=arn:aws:ecs:eu-west-1:891377364444:service/TL-ECS-cluster/mysql-service][0m
[0m[1mmodule.ecs.aws_ecs_service.app_service: Refreshing state... [id=arn:aws:ecs:eu-west-1:891377364444:service/TL-ECS-cluster/app-service][0m
[0m[1mmodule.alb.aws_alb_listener.front_end: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-west-1:891377364444:listener/app/TL-ALB-alb/dcc3acf200d03e8e/bd2204f284eab8a4][0m
[0m[1mmodule.auto_scaling.aws_appautoscaling_target.target: Refreshing state... [id=service/TL-ECS-cluster/app-service][0m
[0m[1mmodule.auto_scaling.aws_appautoscaling_policy.down: Refreshing state... [id=scale_down][0m
[0m[1mmodule.auto_scaling.aws_appautoscaling_policy.up: Refreshing state... [id=scale_up][0m
[0m[1mmodule.auto_scaling.aws_cloudwatch_metric_alarm.service_cpu_low: Refreshing state... [id=cpu_utilization_low][0m
[0m[1mmodule.auto_scaling.aws_cloudwatch_metric_alarm.service_cpu_high: Refreshing state... [id=cpu_utilization_high][0m

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  [33m~[0m update in-place[0m
[31m-[0m/[32m+[0m destroy and then create replacement[0m

Terraform will perform the following actions:

[1m  # module.ecs.aws_ecs_service.app_service[0m will be updated in-place
[0m  [33m~[0m[0m resource "aws_ecs_service" "app_service" {
        id                                 = "arn:aws:ecs:eu-west-1:891377364444:service/TL-ECS-cluster/app-service"
        name                               = "app-service"
        tags                               = {}
      [33m~[0m[0m task_definition                    = "arn:aws:ecs:eu-west-1:891377364444:task-definition/TL-ECS-task-definition:26" -> (known after apply)
        [90m# (15 unchanged attributes hidden)[0m[0m

        [90m# (4 unchanged blocks hidden)[0m[0m
    }

[1m  # module.ecs.aws_ecs_task_definition.app[0m must be [1m[31mreplaced[0m
[0m[31m-[0m/[32m+[0m[0m resource "aws_ecs_task_definition" "app" {
      [33m~[0m[0m arn                      = "arn:aws:ecs:eu-west-1:891377364444:task-definition/TL-ECS-task-definition:26" -> (known after apply)
      [33m~[0m[0m arn_without_revision     = "arn:aws:ecs:eu-west-1:891377364444:task-definition/TL-ECS-task-definition" -> (known after apply)
      [33m~[0m[0m container_definitions    = jsonencode(
          [33m~[0m[0m [
              [33m~[0m[0m {
                  [31m-[0m[0m essential             = true
                  [32m+[0m[0m healthCheck           = {
                      [32m+[0m[0m command     = [
                          [32m+[0m[0m "CMD-SHELL",
                          [32m+[0m[0m "curl -f localhost:8080/api/todoitems || exit 1",
                        ]
                      [32m+[0m[0m interval    = 15
                      [32m+[0m[0m retries     = 3
                      [32m+[0m[0m startPeriod = 30
                      [32m+[0m[0m timeout     = 5
                    }
                  [31m-[0m[0m mountPoints           = []
                    name                  = "app"
                  [33m~[0m[0m portMappings          = [
                      [33m~[0m[0m {
                          [31m-[0m[0m protocol      = "tcp"
                            [90m# (2 unchanged attributes hidden)[0m[0m
                        },
                    ]
                  [31m-[0m[0m systemControls        = []
                  [31m-[0m[0m volumesFrom           = []
                    [90m# (6 unchanged attributes hidden)[0m[0m
                },
            ] [31m# forces replacement[0m[0m
        )
      [33m~[0m[0m id                       = "TL-ECS-task-definition" -> (known after apply)
      [33m~[0m[0m revision                 = 26 -> (known after apply)
      [31m-[0m[0m tags                     = {} [90m-> null[0m[0m
      [33m~[0m[0m tags_all                 = {} -> (known after apply)
        [90m# (11 unchanged attributes hidden)[0m[0m
    }

[1mPlan:[0m 1 to add, 1 to change, 1 to destroy.
[0m[90m
─────────────────────────────────────────────────────────────────────────────[0m

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @thibs12, Action: `pull_request`*